// Apiwat Ketsawong

// ฟังก์ชัน sumTwoSmallestNums: คำนวณผลรวมของตัวเลขที่น้อยที่สุด 2 ตัวในอาร์เรย์ โดยต้องเป็นตัวเลขที่มีค่ามากกว่า 0
function sumTwoSmallestNums(arr) {
    // กรองอาร์เรย์เพื่อเลือกเฉพาะตัวเลขที่มีค่ามากกว่า 0 และหาค่าที่น้อยที่สุดในกลุ่มแรก
    const num1 = Math.min(...arr.filter(f => f > 0));
    // ลบค่าที่น้อยที่สุดออกจากอาร์เรย์ต้นฉบับ เพื่อไม่ให้ถูกเลือกซ้ำ
    arr.splice(arr.indexOf(num1), 1);
    // กรองอาร์เรย์อีกครั้งเพื่อเลือกตัวเลขที่มีค่ามากกว่า 0 และหาค่าที่น้อยที่สุดในกลุ่มใหม่
    const num2 = Math.min(...arr.filter(f => f > 0));

    // คืนค่าผลรวมของตัวเลขที่น้อยที่สุด 2 ตัว
    return num1 + num2;
}

// ทดสอบฟังก์ชันด้วยตัวอย่าง
console.log(sumTwoSmallestNums([19, 5, 42, 2, 77])); // ผลลัพธ์: 7 (2 + 5)
console.log(sumTwoSmallestNums([10, 343445353, 3453445, 3453545353453])); // ผลลัพธ์: 3453455 (10 + 343445353)
console.log(sumTwoSmallestNums([2, 9, 6, -1])); // ผลลัพธ์: 8 (2 + 6)
console.log(sumTwoSmallestNums([879, 953, 694, -847, 342, 221, -91, -723, 791, -587])); // ผลลัพธ์: 563 (221 + 342)
console.log(sumTwoSmallestNums([3683, 2902, 3951, -475, 1617, -2385])); // ผลลัพธ์: 4519 (1617 + 2902)
